Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: * arrow = numeric: 0 is no arrows, 1 arrow at the end, 2 begin, 3 both ends * contour = text: list of points which get the tick or one of $-1$, $-2$ or $-3$ to mark undefined tick, tick in the middle or no tick, respectively * section = text: list of points which get the orientation arrow or $-1$ to indicate no arrows * slope = numeric: 0 no border, 1 border; text: list of (point,direction,length) triplets
ru_ru: * arrow (стрелка) = числовая: 0 -- нет стрелок, 1 -- стрелка в конце, 2 -- в начале, 3 -- с обоих концов; * contour (контур) = текст: список точек, которые получают галочку или может принимать одно из значений: $-1$, $-2$ или $-3$ для неопределенной галочки, галочки в середине или без галочки, соответственно; * section (сечение) = текст: список точек, которые получают стрелку\break ориентации или $-1$, чтобы указать стрелки; * slope (склон) = числовая: 0 -- нет границы, 1 -- есть граница; текст: список триплет (точка, направление, длина).

source: * black---Therion programs and macros (XTherion is written in Tcl/Tk, so it needs this interpreter to run) * red---package * green---input files created by the user and output files created by Therion
ru_ru: * черный -- программы и макросы Therion'а (XTherion написан на Tcl/Tk, поэтому для него требуется этот интерпретатор); * красный -- пакет; * зеленый -- входные файлы, созданные пользователем и выходные файлы, созданные Therion'ом.

source: * boolean |ATTR__shotflag_splay|, |ATTR__shotflag_duplicate|, |ATTR__shotflag_approx| = set for line survey * boolean |ATTR__stationflag_splay| = set true for endstations of splay shots * boolean |ATTR__scrap_centerline| = set true for scraps created from centreline * boolean |ATTR__elevation| = true for (extended) elevation, false for plan projection * numeric |ATTR__height| = height of a pit or wall:pit * string |ATTR__id| = contains current object ID * string |ATTR__survey| = contains current survey name * string |ATTR__scrap| = contains current scrap name * picture |ATTR__text| = contains typeset text e.g.for point continuation * string |NorthDir| = `true' or `grid' * numeric |MagDecl| = magnetic declination in degrees * numeric |GridConv| = grid meridian convergence in degrees
ru_ru: * булевская |ATTR__shotflag_splay|, |ATTR__shotflag_duplicate|, |ATTR__shotflag_approx| = устанавливает линию съемки; * булевская |ATTR__stationflag_splay| = установлено в `true' для боковых\break замеров крайних станций; * булевская |ATTR__scrap_centerline| = установлено в `true' для скрапов\break созданных по нитке хода; * булевская |ATTR__elevation| = устанавливается в `true' для разреза (разрез-развертки), в `false' для проекции плана; * числовая |ATTR__height| = глубина колодца (pit) или входного колодца\break (wall:pit); * строковая |ATTR__id| = содержит текущий идентификатор объекта ID; * строковая |ATTR__survey| = содержит текущее название съемки; * строковая |ATTR__scrap| = содержит текущее название скрапа; * изображение |ATTR__text| = содержит набранный текст, например для\break точечного символа -- продолжение (continuation); * строковая |NorthDir| = `true' или `grid'; * числовая |MagDecl| = магнитное склонение в градусах; * числовая |GridConv| = конвергенция сетки магнитного меридиана в\break градусах.

source: * bottom = all symbols with |-place bottom| option set * default-bottom = all |area| symbols by default * default = symbols which don't belong to any other group * default-top = |ceiling-step| and |chimney| by default * top = all symbols with |-place top| option set
ru_ru: * bottom = все символы с опцией |-place bottom|; * default-bottom = все символы |области| по умолчанию; * default = символы, которые не принадлежат ни к какой другой группе; * default-top = |ceiling-step| (уступ потолка) и |chimney| (камин) по умолчанию; * top = все символы с опцией |-place top|.

source: * colour schemes * survey tree for selecting sub-surveys to display * spatial filtering (e.g. clipping by planes) * support for multiple surfaces
ru_ru: * цветовые схемы; * дерево съемок для выбора подсекций для отображения; * пространственная фильтрация (например, отсечение плоскостями); * поддержка нескольких поверхностей.

source: * complete the predefined symbol sets * generate registers for atlas * use MPlib instead of
ru_ru: * завершить предопределенные наборы символов; * генерировать регистры для атласа; * использовать MPlib вместо

source: * completely new GUI in the far future (see {https://labyrinth.speleo.sk})
ru_ru: * полностью новый графический интерфейс в далеком будущем (смотрите {https://labyrinth.speleo.sk})

source: * each line ending with a backslash (|) is considered to continue on the next line, as if there was neither line-break nor backlash.
ru_ru: * Каждая строка, заканчивающаяся обратным слэшем (|), считается\break продолженной на следующей строке, как будто не было ни разрыва строки, ни пробела.

source: * edit the |texts_xx.txt| file.
ru_ru: * отредактируйте файл |texts_xx.txt|.

source: * everything that follows |#|, until the end of line---even inside a command---is considered to be a comment, and is ignored.
ru_ru: * Все, что следует за |#| и до конца строки, даже внутри команды, считается комментарием и игнорируется.

source: * fill an uniform or randomised grid in a temporary picture (having dimensions |bbox path|) with some point symbols; clip it according to |path| and add to the |currentpicture| * fill |path| with a solid colour * fill |path| with a predefined pattern using a |withpattern| keyword.
ru_ru: * заполнить единую или рандомизированную сетку во временном\break изображении (имеющем размеры |bbox path|) с некоторыми точечными\break символами; закрепите его в соответствии с |path| и добавьте в\break |currentpicture|; * заполните |path| сплошным цветом; * заполните |path| с предопределенным шаблоном с использованием\break |withpattern|.

source: * freetype 2 and newer; freetype-config must work * wxWidgets 2.6 and newer; wx-config must work * VTK 5.0 and newer * libjpeg, libpng, zlib
ru_ru: * freetype 2 или новее с поддержкой freetype-config; * wxWidgets 2.6 или новее с поддержкой wx-config; * VTK 5.0 или новее; * libjpeg, libpng, zlib.

source: * if the value of an option or argument contains spaces, you should enclose this value in |" "| or |[ ]|.
ru_ru: * Если значение параметра или аргумента содержит пробелы, вы должны заключить это значение в |" "| или |[ ]|.

source: * if you refer to map, you can specify offset at which this sub-map will be displayed together with preview type of its original position.
ru_ru: * если вы указываете название карты, то вы можете указать смещение, в месте которого эта подкарта будет отображаться.

source: * improve 2D editing capabilities
ru_ru: * улучшить возможности 2D-редактирования.

source: * improve passage walls modeling
ru_ru: * улучшить моделирование ходов.

source: * in { shapefile} export they are written directly to the associated dbf file, * in maps generated using (PDF, SVG) the attributes are written in the source file as strings (named like |ATTR_<name>|) and can be evaluated and used by user in symbols definition macros.
ru_ru: * при экспорте в { shapefile} они записываются непосредственно в файл dbf; * в картах, сгенерированных с использованием (PDF, SVG)\break атрибуты записываются в исходный файл как строки\break (именуемые |ATTR_<имя>|) и могут быть оценены и использованы\break пользователем в макросах определения символов.

source: * install the following static/win32 packages (i686-w64-mingw32.static-42) to the directory |/usr/lib/mxe/|: binutils, bzip2, expat, freetype-bootstrap, gcc, gettext, glib, harfbuzz, jpeg, libiconv, libpng, tiff, vtk, wxwidgets, xz, zlib.
ru_ru: * установите следующие static/win32-пакеты (i686-w64-mingw32.static-42) в\break директорию |/usr/lib/mxe/|: binutils, bzip2, expat, freetype-bootstrap, gcc,\break gettext, glib, harfbuzz, jpeg, libiconv, libpng, tiff, vtk, wxwidgets, xz, zlib;

source: * it has |-visibility| option set |on| (all symbols by default), * it hasn't been hidden by the |-symbol-hide| option in layout, * if its |-context| option is set, the corresponding symbol hasn't been hidden by the |-symbol-hide| option in layout.
ru_ru: * он имеет опцию |-visibility| (видимый) со значением |on| (все символы по умолчанию); * он не был скрыт опцией |-symbol-hide| (скрыть символ) в layout; * если его опция |-context| (контекст) установлена, а соответствующий символ не был скрыт опцией |-symbol-hide| (скрыть символ) в layout.

source: * loop closure information in SQL
ru_ru: * информация о закрытии колец в SQL.

source: * modify PATH: {`12|export PATH=/usr/lib/mxe/usr/bin:$PATH|} * |cd therion| * |make config-win32cross| * |make|
ru_ru: * измените PATH: {`12|export PATH=/usr/lib/mxe/usr/bin:$PATH|}; * |cd therion|; * |make config-win32cross|; * |make|.

source: * on UNIX: |.|, |$THERION|, |$HOME/.therion|, |/etc|, |/usr/etc|, |/usr/local/etc| * on Windows: |.|, |$THERION|, |$HOMEtherion|, |<Therion-installation-directory>|, |C:INDOWS|, |C:INNT|, |C:rogram Filesherion| ndlist
ru_ru: * в UNIX: |.|, |$THERION|, |$HOME/.therion|, |/etc|, |/usr/etc|, |/usr/local/etc|; * в Windows: |.|, |$THERION|, |$HOMEtherion|, |<директория установки|\break |Therion'а>|, |C:INDOWS|, |C:INNT|, |C:rogram Filesherion| ndlist

source: * one of the letters `p', `l', `a', `s' for point, line, area or special symbols, respectively; * underscore character; * symbol type as listed in the chapter { Data format} with all dashes removed; * if the symbol has a subtype, add underscore character and subtype; * underscore character; * symbol set identifier in uppercase
ru_ru: * одна из букв `p', `l', `a', `s' для точки, линии, области или специальных символов, соответственно; * символ подчеркивания; * тип символа, указанный в главе { Формат данных} с удалением всех тире; * если символ имеет подтип, добавьте символ подчеркивания и подтип; * символ подчеркивания; * идентификатор набора символов в верхнем регистре.

source: * press Ctrl+A or { File commands} $$ { Insert} $$ { area} to switch to the `insert area border' mode * RightClick on the lines, that surround desired area * Esc to finish area border lines insertion
ru_ru: * нажмите Ctrl+A или { Команды в файле} $$ { Вставить} $$ { область}, чтобы переключиться в режим `вставки границ области'; * щелчок правой кнопкой мыши на линиях, которые окружают желаемую область; * Esc, чтобы закончить ввод границ области.

source: * press { Scale} button in the { Scraps} menu and click on two different places on the image where the endpoints of calibration arrow should be, or * move mouse pointer to desired position, read pointer coordinates from the status bar and enter these coordinates into { picture scale points} boxes in the { Scraps} control.
ru_ru: * нажать кнопку { Масштаб} в меню { Скрап} и щелкнуть два разных места на изображении, где должны быть конечные точки калибровочной стрелки, или * переместить указатель мыши в нужную позицию, прочитать координаты указателя и ввести эти координаты в { масштабирующие точки для\break картинки} в меню { Скрап}.

source: * run `|perl process.pl export xx|' in the `thlang' Therion source subdirectory.
ru_ru: * запустите `|perl process.pl export xx|' в подкаталоге Therion'а `thlang';

source: * run |make update| * compile Therion
ru_ru: * запустите |make update|; * скомпилируйте Therion.

source: * scrap size = $ 2.8 2.8$ m in the output scale (limit) * page size =
ru_ru: * размер скрапа = $ 2.8 2.8$ м в выходном масштабе (ограничение\break); * размер страницы =

source: * select area you want to edit * pres `Insert' in the { Area control} to insert other border lines at current cursor position * pres `Insert ID' to insert border with given ID at current cursor position * pres `Delete' to remove selected area border line
ru_ru: * выберите область, которую вы хотите отредактировать; * нажмите `Вставить' в { Область}, чтобы вставить другие границы в текущую позицию курсора; * нажмите `Вставить по ID', чтобы вставить границу с заданным ID в\break текущую позицию курсора; * нажмите `Delete', чтобы удалить выбранную границу области.

source: * select the point at which you want to split the line; press { Edit line} $$ { Split line} in the { Line control} panel
ru_ru: * выберите точку, в которой вы хотите разделить линию; нажмите { Править линию} $$ { Разделить линию} в панели { Линия}.

source: * select the point before which you want to insert points; insert required points; press Esc or left-click on the point you selected at the beginning
ru_ru: * выберите точку, перед которой вы хотите вставить новые точки; вставить необходимые точки; нажмите Esc или щелкните левой кнопкой мыши по выбранной вами точке в начале.

source: * select the point you want to delete; press { Edit line} $$ { Delete point} in the { Line control} panel
ru_ru: * выберите точку, которую хотите удалить; нажмите { Править линию} $$ { Удалить точку} в панели { Линия}.

source: * set the { U} pair variable to $({width2},{height2})$ of the symbol for correct alignment.
ru_ru: * устанавливается переменная { U} (пара) символа в $({width2},{height2})$ для\break правильного выравнивания.

source: * the data lines consist of border line references (IDs) * |place <bottom/default/top>| = changes displaying order in the map.
ru_ru: * строки данных состоят из ссылок на линии границы (ID). * |place <bottom/default/top>| = изменяет порядок отображения на карте.

source: * the data lines consist of scrap or map references.
ru_ru: * строки данных состоят из названий скрапа или карты.

source: * there is no warning ``|scrap outline intersects itself|'' * when you set passage fill to any color (|color map-fg <number>| option in |layout|), you may see what Therion considers to be inside of the scrap.
ru_ru: * не выводится предупреждение ``|scrap outline intersects itself|''; * когда вы устанавливаете цвет заливки ходов (|color map-fg <номер>| опция в |layout|), вы можете видеть что Therion считает внутренней областью скрапа.

source: * unpack the source distribution |therion-5.*.tar.gz| * |cd therion| * |make config-macosx| or |make config-win32|, if you use MacOS X or Windows, respectively * |make| * |sudo make install|
ru_ru: * распаковать исходники дистрибутива |therion-5.*.tar.gz|; * |cd therion|; * |make config-macosx| или |make config-win32|, если вы используете MacOS X или Windows, соответственно; * |make|; * |sudo make install|.

source: * { 0cm minus 4pt |symbol-assign <point/line/area/group/special> <symbol-type> <symbol-set>| = display a particular symbol in the given symbol-set.
ru_ru: * { 0cm minus 4pt |symbol-assign <point/line/area/group/special> <тип символа> <набор|\break |символов>| = отображение определенного символа в заданном наборе\break символов.

source: * { 2000} Jan: xthedit (Tcl/Tk), a graphical front-end for Therion
ru_ru: * { 2000} Январь: xthedit (Tcl/Tk) -- графический интерфейс для Therion'а.

source: * { keyword} = a sequence of |A-Z|, |a-z|, |0-9| and |_-/| characters (not starting with `|-|').
ru_ru: * { ключевое слово} = последовательность |A-Z|, |a-z|, |0-9| и |_-/| символов (не\break начинающиеся с `|-|').

source: * { point symbols:} symbolic passage fills (bedrock guano), * { line symbols:} all line symbols which don't have |-outline| option set with the exception of |section|, |arrow|, |label|, |gradient| and |water-flow| * { area symbols:} all.
ru_ru: * { точечные символы:} символы наполнения ходов (коренная порода гуано); * { линейные символы:} все символы линий, которые не имеют опцию |-outline|, за исключением |section| (выносная линия сечения), |arrow| (стрелка), |label| (текстовая метка), |gradient| (уклон хода) и |water-flow| (водоток); * { символы области:} все.

source: * { ghostscript} if you want to create calibrated images from georeferenced PDF maps.
ru_ru: * { ghostscript}, если вы хотите создать откалиброванные изображения карт с привязкой к географическим картам.

source: * { extkeyword} = keyword that can also contain |+*.,'| characters, but not on the first position.
ru_ru: * { внешнее ключевое слово} = слово, которое также может содержать |+*.,'| символы, но не в первой позиции.

source: * { date} = a date (or a time interval) specification in a format |YYYY.MM.DD@HH:MM:SS.SS - YYYY.MM.DD@HH:MM:SS.SS| or `|-|' to leave a date unspecified.
ru_ru: * { дата} = спецификация даты (или временного интервала) в формате |YYYY.MM.DD@HH:MM:SS.SS - YYYY.MM.DD@HH:MM:SS.SS| или `|-|' чтобы указать неопределенную дату.

source: * { person} = a person's first name and surname separated by whitespace characters.
ru_ru: * { персона} = имя и фамилия человека, разделенные пробельными символами.

source: * { string} = a sequence of any characters.
ru_ru: * { строка} = последовательность любых символов.

source: * { units} = length units supported: meter[s], centimeter[s], inch[es], feet[s], yard[s] (also m, cm, in, ft, yd).
ru_ru: * { единицы} = поддерживаемые единицы длины: meter[s] (метры),\break centimeter[s] (сантиметры), inch[es] (дюймы), feet[s] (футы), yard[s] (ярды) (можно сокращать m, cm, in, ft, yd).

source: * |--print-encodings| = Print a list of all supported input encodings.
ru_ru: * |--print-encodings| = выводит список всех поддерживаемых входных\break кодировок.

source: * |--print-environment| = Print environment settings for therion.
ru_ru: * |--print-environment| = выводит настройки среды для Therion'а.

source: * |--print-init-file| = Print a default initialization file.
ru_ru: * |--print-init-file| = выводит файл инициализации по умолчанию.

source: * |--print-symbols| = Print a list of all therion supported map symbols in |symbols.xhtml| file.
ru_ru: * |--print-symbols| = выводит список всех символов карты, поддерживаемых Therion'ом в файл |symbols.xhtml|.

source: * |--print-tex-encodings| = Print a list of all supported encodings for PDF output.
ru_ru: * |--print-tex-encodings| = выводит список всех поддерживаемых кодировок для вывода в PDF.

source: * |--use-extern-libs| = Don't copy and macros to working directory.
ru_ru: * |--use-extern-libs| = не копирует макросы и в рабочий каталог.

source: * |-L| = Do not create a log-file.
ru_ru: * |-L| = не создавайте файл журнала.

source: * |-d| = Turn on debugging mode.
ru_ru: * |-d| = включить режим отладки.

source: * |-h, --help| = Display short help.
ru_ru: * |-h, --help| = показать краткую справку.

source: * |-l <log-file>| = Change the name of the log file.
ru_ru: * |-l <файл журнала>| = изменить имя файла журнала.

source: * |-p <search-path>| = This option is used to set the search path (or list of colon-separated paths) which therion uses to find its source files (if it doesn't find them in the working directory).
ru_ru: * |-p <путь поиска>| = эта опция используется для установки пути поиска (или списка путей разделенных двоеточиями), который использует Therion для поиска его исходных файлов (если он не находит их в рабочем каталоге).

source: * |-q| = Run therion in quiet mode.
ru_ru: * |-q| = запустить Therion в тихом режиме.

source: * |-s <source-file>| = Set the name of the source file.
ru_ru: * |-s <исходный файл>| = установить имя исходного файла.

source: * |-v, --version| = Display version information.
ru_ru: * |-v, --version| = отображать информацию о версии.

source: * |-x| = Generate file `.xtherion.dat' with additional information for XTherion.
ru_ru: * |-x| = создает файл `.xtherion.dat' с дополнительной информацией о\break XTherion'е.

source: * |<encoding-name>| = to see a list of all the supported encoding names, run Therion with |--print-encodings| option.
ru_ru: * |<имя кодировки>| = чтобы увидеть список всех поддерживаемых имен кодировок, запустите Therion с опцией |--print-encodings|.

source: * |<file-name>|
ru_ru: * |<имя файла>|

source: * |<language ID>| = standard ISO language identifier (e.g. |en| or |en_GB|) * |<therion text>| = therion text to translate.
ru_ru: * |<ID языка>| = стандартный идентификатор языка ISO (например, |en| или |en_GB|). * |<therion текст>| = текст Therion'а для перевода.

source: * |<object>| = any survey or map, identified by its ID.
ru_ru: * |<объект>| = любая съемка или карта, имеющие идентификатор ID.

source: * |<pointX>| can be an ID of a point or line symbol, optionally followed by a line point mark |<id>:<mark>| (e.g. |podangl_l31@podangl:mark1|).
ru_ru: * |<точкаX>| может быть идентификатором точечного символа или символа линии, необязательно сопровождаемый меткой символа линии\break |<идентификатор>:<метка>| (например, |podangl_l31@podangl:mark1|).\break

source: * |<type>| = The following export types are supported:
ru_ru: * |<тип>| = поддерживаются следующие типы экспорта:

source: * |<type>| determines the type of an object.
ru_ru: * |<тип>| определяет тип объекта.

source: * |<type>| is a keyword that determines the type of line.
ru_ru: * |<тип>| это зарезервированное слово, которое определяет тип линии.\break

source: * |<type>| is one of following: |water|, |sump|, |sand|, |debris|, |blocks|, |flowstone|, |moonmilk|, |snow|, |ice|, |clay|, |pebbles|, |bedrock|An empty area which can be used to clean the background.], |u|For user defined area symbols, may be followed by arbitrary subtype.].
ru_ru: * |<тип>| является одним из следующих: |water| (вода), |sump| (сифон), |sand| (песок), |debris| (щебень), |blocks| (навал глыб), |flowstone| (натечный каскад), |moonmilk| (мондмильх), |snow| (снег), |ice| (лед), |clay| (глина), |pebbles| (галька), |bedrock| (коренная порода)Пустая область, которая может быть использована для очистки фона.], |u|Для пользовательских символов области, может иметь произвольный подтип.].

source: * | <i>|, || = text between these macros is typeset in |<i>| columns
ru_ru: * | <i>|, || = текст между этими макросами набирается в столбцы |<i>|.

source: * |[#1 #2 #3]| for colour changes (RGB values in the range 0--100), and
ru_ru: * |[#1 #2 #3]| для изменения цвета (значения RGB в диапазоне 0-100) и

source: * |[#1]| for size changes,
ru_ru: * |[#1]| для изменения размера,

source: * || = The box containing the map.
ru_ru: * || = бокс содержащий карту.

source: * || = The box containing the navigator, with dimensions
ru_ru: * || = бокс содержащий навигатор, с размерами

source: * || = This conditional is set true or false according to the |page-numbers| option of the |layout| command.
ru_ru: * || = это значение установлено в true или false в\break соответствии с опцией |page-numbers| команды |layout|.

source: * || = conditional; true if map projection is plan and symbol north-arrow is not hidden in |layout| * || = conditional; true if scalebar is not hidden * || = PDF form with the north arrow * || = PDF form with the scale bar
ru_ru: * || = условный; true, если проекция карты -- это план, а символ стрелки на север не скрыт в |layout|; * || = условный; true, если шкала масштаба не скрыта; * || = PDF-форма со стрелкой на север; * || = PDF-форма со шкалой масштаба.
